; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-40)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 ball39 ball40 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(ball ball39)
(ball ball40)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 room3)
(at ball30 room3)
(at ball31 room3)
(at ball32 room3)
(at ball33 room3)
(at ball34 room3)
(at ball35 room3)
(at ball36 room3)
(at ball37 room3)
(at ball38 room3)
(at ball39 room3)
(at ball40 room3)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at ball34 rooma)
(at ball35 rooma)
(at ball36 rooma)
(at ball37 rooma)
(at ball38 rooma)
(at ball39 rooma)
(at ball40 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 40
2. (pick ball28 roomb left)
   deleted: (at ball28 roomb) (free left)
   added: (carry ball28 left)
   goals met: 11 of 40
3. (pick ball27 roomb right)
   deleted: (at ball27 roomb) (free right)
   added: (carry ball27 right)
   goals met: 11 of 40
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 40
5. (drop ball27 rooma right)
   deleted: (carry ball27 right)
   added: (at ball27 rooma) (free right)
   goals met: 12 of 40
6. (drop ball28 rooma left)
   deleted: (carry ball28 left)
   added: (at ball28 rooma) (free left)
   goals met: 13 of 40
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 40
8. (pick ball26 roomb left)
   deleted: (at ball26 roomb) (free left)
   added: (carry ball26 left)
   goals met: 13 of 40
9. (pick ball25 roomb right)
   deleted: (at ball25 roomb) (free right)
   added: (carry ball25 right)
   goals met: 13 of 40
10. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 40
11. (drop ball25 rooma right)
   deleted: (carry ball25 right)
   added: (at ball25 rooma) (free right)
   goals met: 14 of 40
12. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 15 of 40
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 40
14. (pick ball24 roomb left)
   deleted: (at ball24 roomb) (free left)
   added: (carry ball24 left)
   goals met: 15 of 40
15. (pick ball23 roomb right)
   deleted: (at ball23 roomb) (free right)
   added: (carry ball23 right)
   goals met: 15 of 40
16. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 40
17. (drop ball23 rooma right)
   deleted: (carry ball23 right)
   added: (at ball23 rooma) (free right)
   goals met: 16 of 40
18. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 17 of 40
19. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 17 of 40
20. (pick ball22 roomb left)
   deleted: (at ball22 roomb) (free left)
   added: (carry ball22 left)
   goals met: 17 of 40
21. (pick ball21 roomb right)
   deleted: (at ball21 roomb) (free right)
   added: (carry ball21 right)
   goals met: 17 of 40
22. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 17 of 40
23. (drop ball21 rooma right)
   deleted: (carry ball21 right)
   added: (at ball21 rooma) (free right)
   goals met: 18 of 40
24. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 19 of 40
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 19 of 40
26. (pick ball20 roomb left)
   deleted: (at ball20 roomb) (free left)
   added: (carry ball20 left)
   goals met: 19 of 40
27. (pick ball19 roomb right)
   deleted: (at ball19 roomb) (free right)
   added: (carry ball19 right)
   goals met: 19 of 40
28. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 19 of 40
29. (drop ball19 rooma right)
   deleted: (carry ball19 right)
   added: (at ball19 rooma) (free right)
   goals met: 20 of 40
30. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 21 of 40
31. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 21 of 40
32. (pick ball18 roomb left)
   deleted: (at ball18 roomb) (free left)
   added: (carry ball18 left)
   goals met: 21 of 40
33. (pick ball17 roomb right)
   deleted: (at ball17 roomb) (free right)
   added: (carry ball17 right)
   goals met: 21 of 40
34. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 21 of 40
35. (drop ball17 rooma right)
   deleted: (carry ball17 right)
   added: (at ball17 rooma) (free right)
   goals met: 22 of 40
36. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 23 of 40
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 40
38. (pick ball16 roomb left)
   deleted: (at ball16 roomb) (free left)
   added: (carry ball16 left)
   goals met: 23 of 40
39. (pick ball15 roomb right)
   deleted: (at ball15 roomb) (free right)
   added: (carry ball15 right)
   goals met: 23 of 40
40. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 40
41. (drop ball15 rooma right)
   deleted: (carry ball15 right)
   added: (at ball15 rooma) (free right)
   goals met: 24 of 40
42. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 25 of 40
43. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 25 of 40
44. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 25 of 40
45. (pick ball13 roomb right)
   deleted: (at ball13 roomb) (free right)
   added: (carry ball13 right)
   goals met: 25 of 40
46. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 40
47. (drop ball13 rooma right)
   deleted: (carry ball13 right)
   added: (at ball13 rooma) (free right)
   goals met: 26 of 40
48. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 27 of 40
49. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 27 of 40
50. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 27 of 40
51. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 27 of 40
52. (pick ball40 room3 right)
   deleted: (at ball40 room3) (free right)
   added: (carry ball40 right)
   goals met: 27 of 40
53. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 40
54. (drop ball40 rooma right)
   deleted: (carry ball40 right)
   added: (at ball40 rooma) (free right)
   goals met: 28 of 40
55. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 29 of 40
56. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 29 of 40
57. (pick ball39 room3 left)
   deleted: (at ball39 room3) (free left)
   added: (carry ball39 left)
   goals met: 29 of 40
58. (pick ball38 room3 right)
   deleted: (at ball38 room3) (free right)
   added: (carry ball38 right)
   goals met: 29 of 40
59. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 29 of 40
60. (drop ball38 rooma right)
   deleted: (carry ball38 right)
   added: (at ball38 rooma) (free right)
   goals met: 30 of 40
61. (drop ball39 rooma left)
   deleted: (carry ball39 left)
   added: (at ball39 rooma) (free left)
   goals met: 31 of 40
62. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 31 of 40
63. (pick ball37 room3 left)
   deleted: (at ball37 room3) (free left)
   added: (carry ball37 left)
   goals met: 31 of 40
64. (pick ball36 room3 right)
   deleted: (at ball36 room3) (free right)
   added: (carry ball36 right)
   goals met: 31 of 40
65. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 31 of 40
66. (drop ball36 rooma right)
   deleted: (carry ball36 right)
   added: (at ball36 rooma) (free right)
   goals met: 32 of 40
67. (drop ball37 rooma left)
   deleted: (carry ball37 left)
   added: (at ball37 rooma) (free left)
   goals met: 33 of 40
68. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 33 of 40
69. (pick ball35 room3 left)
   deleted: (at ball35 room3) (free left)
   added: (carry ball35 left)
   goals met: 33 of 40
70. (pick ball34 room3 right)
   deleted: (at ball34 room3) (free right)
   added: (carry ball34 right)
   goals met: 33 of 40
71. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 33 of 40
72. (drop ball34 rooma right)
   deleted: (carry ball34 right)
   added: (at ball34 rooma) (free right)
   goals met: 34 of 40
73. (drop ball35 rooma left)
   deleted: (carry ball35 left)
   added: (at ball35 rooma) (free left)
   goals met: 35 of 40
74. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 35 of 40
75. (pick ball33 room3 left)
   deleted: (at ball33 room3) (free left)
   added: (carry ball33 left)
   goals met: 35 of 40
76. (pick ball32 room3 right)
   deleted: (at ball32 room3) (free right)
   added: (carry ball32 right)
   goals met: 35 of 40
77. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 35 of 40
78. (drop ball32 rooma right)
   deleted: (carry ball32 right)
   added: (at ball32 rooma) (free right)
   goals met: 36 of 40
79. (drop ball33 rooma left)
   deleted: (carry ball33 left)
   added: (at ball33 rooma) (free left)
   goals met: 37 of 40
80. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 37 of 40
81. (pick ball31 room3 left)
   deleted: (at ball31 room3) (free left)
   added: (carry ball31 left)
   goals met: 37 of 40
82. (pick ball30 room3 right)
   deleted: (at ball30 room3) (free right)
   added: (carry ball30 right)
   goals met: 37 of 40
83. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 37 of 40
84. (drop ball30 rooma right)
   deleted: (carry ball30 right)
   added: (at ball30 rooma) (free right)
   goals met: 38 of 40
85. (drop ball31 rooma left)
   deleted: (carry ball31 left)
   added: (at ball31 rooma) (free left)
   goals met: 39 of 40
86. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 39 of 40
87. (pick ball29 room3 left)
   deleted: (at ball29 room3) (free left)
   added: (carry ball29 left)
   goals met: 39 of 40
88. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 39 of 40
89. (drop ball29 rooma left)
   deleted: (carry ball29 left)
   added: (at ball29 rooma) (free left)
   goals met: 40 of 40
